Repository: HerniRG/WorldTV
Catalog: WorldTV/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, hi, it, ja, pt, zh_hans

# search.prompt
source: Channels, countries or categories
ar: قنوات أو دول أو فئات
de: Sender, Länder oder Kategorien
es: Canales, países o categorías
fr: Chaînes, pays ou catégories
hi: चैनल, देश या श्रेणियाँ
it: Canali, paesi o categorie
ja: チャンネル、国、カテゴリ
pt: Canais, países ou categorias
zh_hans: 频道、国家/地区或类别

# search.title
source: Search
ar: بحث
de: Suchen
es: Buscar
fr: Rechercher
hi: खोजें
it: Cerca
ja: 検索
pt: Pesquisar
zh_hans: 搜索

# settings.about
source: About and attributions
ar: حول والإسناد
de: Über und Namensnennungen
es: Acerca de y atribuciones
fr: À propos et attributions
hi: परिचय और श्रेय
it: Informazioni e attribuzioni
ja: アプリ情報とクレジット
pt: Sobre e atribuições
zh_hans: 关于与署名

# settings.autoplay
source: Play channels automatically
ar: تشغيل القنوات تلقائيًا
de: Sender automatisch abspielen
es: Reproducir canales automáticamente
fr: Lire les chaînes automatiquement
hi: चैनल स्वचालित रूप से चलाएँ
it: Riproduci canali automaticamente
ja: チャンネルを自動再生する
pt: Reproduzir canais automaticamente
zh_hans: 自动播放频道

# settings.clearCache
source: Clear catalog cache
ar: مسح ذاكرة تخزين الكتالوج
de: Katalog-Cache leeren
es: Borrar caché del catálogo
fr: Vider le cache du catalogue
hi: कैटलॉग कैश साफ़ करें
it: Svuota cache del catalogo
ja: カタログのキャッシュを消去
pt: Limpar cache do catálogo
zh_hans: 清除目录缓存

# settings.clearFavorites
source: Clear favorites
ar: مسح المفضلة
de: Favoriten löschen
es: Borrar favoritos
fr: Effacer les favoris
hi: पसंदीदा साफ़ करें
it: Cancella preferiti
ja: お気に入りを消去
pt: Limpar favoritos
zh_hans: 清除收藏

# settings.clearHistory
source: Clear viewing history
ar: مسح سجل المشاهدة
de: Verlauf löschen
es: Borrar historial de reproducción
fr: Effacer l'historique de visionnage
hi: देखने का इतिहास साफ़ करें
it: Cancella cronologia
ja: 視聴履歴を消去
pt: Limpar histórico de exibição
zh_hans: 清除观看历史

# settings.confirm.delete
source: Delete
ar: حذف
de: Löschen
es: Borrar
fr: Supprimer
hi: हटाएँ
it: Elimina
ja: 削除
pt: Excluir
zh_hans: 删除

# settings.confirm.title
source: This action cannot be undone
ar: لا يمكن التراجع عن هذا الإجراء
de: Diese Aktion kann nicht rückgängig gemacht werden
es: Esta acción no se puede deshacer
fr: Cette action est irréversible
hi: यह कार्रवाई पूर्ववत नहीं की जा सकती
it: Questa azione non può essere annullata
ja: この操作は元に戻せません
pt: Esta ação não pode ser desfeita
zh_hans: 此操作无法撤销

# settings.geoblocked
source: Show geographically restricted channels
ar: إظهار القنوات المقيدة جغرافيًا
de: Geografisch eingeschränkte Sender anzeigen
es: Mostrar canales con restricción geográfica
fr: Afficher les chaînes à restriction géographique
hi: भौगोलिक रूप से प्रतिबंधित चैनल दिखाएँ
it: Mostra canali con restrizioni geografiche
ja: 地理的に制限されたチャンネルを表示
pt: Mostrar canais com restrição geográfica
zh_hans: 显示有地理限制的频道

# settings.lastUpdate
source: Last catalog update
ar: آخر تحديث للكتالوج
de: Letzte Katalogaktualisierung
es: Última actualización del catálogo
fr: Dernière mise à jour du catalogue
hi: कैटलॉग अंतिम अपडेट
it: Ultimo aggiornamento del catalogo
ja: カタログの最終更新
pt: Última atualização do catálogo
zh_hans: 目录上次更新

# settings.never
source: Never
ar: أبدًا
de: Nie
es: Nunca
fr: Jamais
hi: कभी नहीं
it: Mai
ja: なし
pt: Nunca
zh_hans: 从未

# settings.quality
source: Preferred quality
ar: الجودة المفضلة
de: Bevorzugte Qualität
es: Calidad preferida
fr: Qualité préférée
hi: पसंदीदा गुणवत्ता
it: Qualità preferita
ja: 優先品質
pt: Qualidade preferida
zh_hans: 首选画质

# settings.quality.automatic
source: Automatic
ar: تلقائي
de: Automatisch
es: Automática
fr: Automatique
hi: स्वचालित
it: Automatica
ja: 自動
pt: Automática
zh_hans: 自动

# settings.section.catalog
source: Catalog
ar: الكتالوج
de: Katalog
es: Catálogo
fr: Catalogue
hi: कैटलॉग
it: Catalogo
ja: カタログ
pt: Catálogo
zh_hans: 目录

# settings.section.data
source: Local data
ar: البيانات المحلية
de: Lokale Daten
es: Datos locales
fr: Données locales
hi: स्थानीय डेटा
it: Dati locali
ja: ローカルデータ
pt: Dados locais
zh_hans: 本地数据

# settings.section.playback
source: Playback
ar: التشغيل
de: Wiedergabe
es: Reproducción
fr: Lecture
hi: प्लेबैक
it: Riproduzione
ja: 再生
pt: Reprodução
zh_hans: 播放

# settings.status.cacheCleared
source: Catalog cache cleared.
ar: تم مسح ذاكرة تخزين الكتالوج.
de: Katalog-Cache geleert.
es: Caché del catálogo borrada.
fr: Cache du catalogue vidé.
hi: कैटलॉग कैश साफ़ किया गया।
it: Cache del catalogo svuotata.
ja: カタログのキャッシュを消去しました。
pt: Cache do catálogo limpo.
zh_hans: 目录缓存已清除。

# settings.status.failed
source: The operation could not be completed.
ar: تعذّر إكمال العملية.
de: Der Vorgang konnte nicht abgeschlossen werden.
es: No se ha podido completar la operación.
fr: L'opération n'a pas pu être effectuée.
hi: ऑपरेशन पूरा नहीं किया जा सका।
it: L'operazione non ha potuto essere completata.
ja: 操作を完了できませんでした。
pt: Não foi possível concluir a operação.
zh_hans: 无法完成此操作。

# settings.status.historyCleared
source: Viewing history cleared.
ar: تم مسح سجل المشاهدة.
de: Verlauf gelöscht.
es: Historial de reproducción borrado.
fr: Historique de visionnage effacé.
hi: देखने का इतिहास साफ़ किया गया।
it: Cronologia cancellata.
ja: 視聴履歴を消去しました。
pt: Histórico de exibição limpo.
zh_hans: 观看历史已清除。

# settings.status.refreshed
source: Catalog updated.
ar: تم تحديث الكتالوج.
de: Katalog aktualisiert.
es: Catálogo actualizado.
fr: Catalogue mis à jour.
hi: कैटलॉग अपडेट किया गया।
it: Catalogo aggiornato.
ja: カタログを更新しました。
pt: Catálogo atualizado.
zh_hans: 目录已更新。

# settings.title
source: Settings
ar: الإعدادات
de: Einstellungen
es: Ajustes
fr: Réglages
hi: सेटिंग्स
it: Impostazioni
ja: 設定
pt: Configurações
zh_hans: 设置

# sources.aboutDisclaimer
source: Sources are added by the user. WorldTV does not provide or curate channel streams.
ar: المصادر يضيفها المستخدم. لا تتضمن WorldTV بث القنوات أو تختارها.
de: Quellen werden vom Benutzer hinzugefügt. WorldTV stellt keine Senderstreams bereit und kuratiert sie nicht.
es: Las fuentes las añade el usuario. WorldTV no proporciona ni selecciona emisiones de canales.
fr: Les sources sont ajoutées par l’utilisateur. WorldTV ne fournit ni ne sélectionne les flux des chaînes.
hi: स्रोत उपयोगकर्ता जोड़ता है। WorldTV चैनल स्ट्रीम उपलब्ध या चयनित नहीं करता।
it: Le fonti vengono aggiunte dall’utente. WorldTV non fornisce né seleziona i flussi dei canali.
ja: ソースはユーザーが追加します。WorldTV はチャンネルの配信を提供または選定しません。
pt: As fontes são adicionadas pelo utilizador. A WorldTV não fornece nem seleciona transmissões de canais.
zh_hans: 来源由用户添加。WorldTV 不提供或筛选频道流。

# sources.addButton
source: Add source
ar: إضافة مصدر
de: Quelle hinzufügen
es: Añadir fuente
fr: Ajouter une source
hi: स्रोत जोड़ें
it: Aggiungi fonte
ja: ソースを追加
pt: Adicionar fonte
zh_hans: 添加来源

# sources.addSection
source: Add playlist
ar: إضافة قائمة تشغيل
de: Wiedergabeliste hinzufügen
es: Añadir lista
fr: Ajouter une liste
hi: प्लेलिस्ट जोड़ें
it: Aggiungi playlist
ja: プレイリストを追加
pt: Adicionar playlist
zh_hans: 添加播放列表

# sources.delete
source: Delete
ar: حذف
de: Löschen
es: Eliminar
fr: Supprimer
hi: हटाएँ
it: Elimina
ja: 削除
pt: Apagar
zh_hans: 删除

# sources.disclaimer
source: WorldTV does not provide channels or playlists. Add only sources you are authorized to access.
ar: لا توفر WorldTV القنوات أو قوائم التشغيل. أضف فقط المصادر التي يحق لك الوصول إليها.
de: WorldTV stellt keine Sender oder Wiedergabelisten bereit. Füge nur Quellen hinzu, auf die du zugreifen darfst.
es: WorldTV no proporciona canales ni listas. Añade solo fuentes a las que tengas autorización para acceder.
fr: WorldTV ne fournit ni chaînes ni listes de lecture. Ajoutez uniquement des sources auxquelles vous êtes autorisé à accéder.
hi: WorldTV चैनल या प्लेलिस्ट उपलब्ध नहीं कराता। केवल उन्हीं स्रोतों को जोड़ें जिन तक पहुंचने की आपको अनुमति है।
it: WorldTV non fornisce canali o playlist. Aggiungi solo fonti a cui sei autorizzato ad accedere.
ja: WorldTV はチャンネルやプレイリストを提供しません。アクセスが許可されたソースのみ追加してください。
pt: A WorldTV não fornece canais nem playlists. Adicione apenas fontes a que está autorizado a aceder.
zh_hans: WorldTV 不提供频道或播放列表。请仅添加您获授权访问的来源。

# sources.empty
source: No sources added yet. Add a playlist URL to begin.
ar: لم تتم إضافة مصادر بعد. أضف عنوان قائمة تشغيل للبدء.
de: Noch keine Quellen hinzugefügt. Füge eine Wiedergabelisten-URL hinzu, um zu beginnen.
es: Aún no hay fuentes. Añade una URL de lista para empezar.
fr: Aucune source ajoutée. Ajoutez une URL de liste pour commencer.
hi: अभी कोई स्रोत नहीं जोड़ा गया। शुरू करने के लिए प्लेलिस्ट URL जोड़ें।
it: Nessuna fonte aggiunta. Aggiungi un URL di playlist per iniziare.
ja: まだソースが追加されていません。開始するにはプレイリストの URL を追加してください。
pt: Ainda não foram adicionadas fontes. Adicione um URL de playlist para começar.
zh_hans: 尚未添加来源。请添加播放列表 URL 以开始使用。

# sources.error.emptyPlaylist
source: The playlist is empty.
ar: قائمة التشغيل فارغة.
de: Die Wiedergabeliste ist leer.
es: La lista está vacía.
fr: La liste de lecture est vide.
hi: प्लेलिस्ट खाली है।
it: La playlist è vuota.
ja: プレイリストは空です。
pt: A playlist está vazia.
zh_hans: 播放列表为空。

# sources.error.invalidURL
source: The source URL is invalid.
ar: عنوان URL للمصدر غير صالح.
de: Die Quell-URL ist ungültig.
es: La URL de la fuente no es válida.
fr: L’URL de la source n’est pas valide.
hi: स्रोत URL अमान्य है।
it: L’URL della fonte non è valido.
ja: ソース URL が無効です。
pt: O URL da fonte é inválido.
zh_hans: 来源 URL 无效。

# sources.error.noPlayableEntries
source: The playlist does not contain playable entries.
ar: لا تحتوي قائمة التشغيل على عناصر قابلة للتشغيل.
de: Die Wiedergabeliste enthält keine abspielbaren Einträge.
es: La lista no contiene elementos reproducibles.
fr: La liste ne contient aucun élément lisible.
hi: प्लेलिस्ट में चलाए जा सकने वाले आइटम नहीं हैं।
it: La playlist non contiene elementi riproducibili.
ja: プレイリストに再生可能な項目がありません。
pt: A playlist não contém itens reproduzíveis.
zh_hans: 播放列表不包含可播放项目。

# sources.error.unsupportedScheme
source: Only HTTP and HTTPS playlist URLs are supported.
ar: لا يتم دعم سوى عناوين قوائم التشغيل HTTP وHTTPS.
de: Nur HTTP- und HTTPS-Wiedergabelisten-URLs werden unterstützt.
es: Solo se admiten URL de listas HTTP y HTTPS.
fr: Seules les URL de listes HTTP et HTTPS sont prises en charge.
hi: केवल HTTP और HTTPS प्लेलिस्ट URL समर्थित हैं।
it: Sono supportati solo gli URL di playlist HTTP e HTTPS.
ja: HTTP と HTTPS のプレイリスト URL のみ対応しています。
pt: Apenas são suportados URLs de playlists HTTP e HTTPS.
zh_hans: 仅支持 HTTP 和 HTTPS 播放列表 URL。

# sources.listSection
source: Your sources
ar: مصادرك
de: Deine Quellen
es: Tus fuentes
fr: Vos sources
hi: आपके स्रोत
it: Le tue fonti
ja: あなたのソース
pt: As suas fontes
zh_hans: 您的来源

# sources.manage
source: Manage sources
ar: إدارة المصادر
de: Quellen verwalten
es: Gestionar fuentes
fr: Gérer les sources
hi: स्रोत प्रबंधित करें
it: Gestisci fonti
ja: ソースを管理
pt: Gerir fontes
zh_hans: 管理来源

# sources.namePlaceholder
source: Name (optional)
ar: الاسم (اختياري)
es: Nombre (opcional)
fr: Nom (facultatif)
hi: नाम (वैकल्पिक)
it: Nome (facoltativo)
ja: 名前（任意）
pt: Nome (opcional)
zh_hans: 名称（可选）

# sources.title
source: Sources
ar: المصادر
de: Quellen
es: Fuentes
hi: स्रोत
it: Fonti
ja: ソース
pt: Fontes
zh_hans: 来源

# sources.urlPlaceholder
source: M3U or M3U8 URL
ar: عنوان URL لـ M3U أو M3U8
de: M3U- oder M3U8-URL
es: URL M3U o M3U8
fr: URL M3U ou M3U8
hi: M3U या M3U8 URL
it: URL M3U o M3U8
ja: M3U または M3U8 URL
pt: URL M3U ou M3U8
zh_hans: M3U 或 M3U8 URL

# category.explore
source: Explore category
es: Explorar categoría

# sources.error.unreachable
source: The source could not be reached. Check the URL and your connection.
es: No se puede acceder a la fuente. Comprueba la URL y tu conexión.
